In [3]:
import pandas as pd
data = {'Student': ['Jas', 'Tej', 'Gur', 'Jot'], 'Age': [30, 28, 25, 22], 'Country': ['Canada', 'Canada', 'USA', 'UK'], 'Program': ['Business Analyst', 'Trucking', 'MBA', 'Nursing']}

df = pd.DataFrame(data)
print(df)

  Student  Age Country           Program
0     Jas   30  Canada  Business Analyst
1     Tej   28  Canada          Trucking
2     Gur   25     USA               MBA
3     Jot   22      UK           Nursing

In [12]:
b = df[['Program']]
b

            Program
0  Business Analyst
1          Trucking
2               MBA
3           Nursing

In [14]:
c = df[['Country','Program']]
c

  Country           Program
0  Canada  Business Analyst
1  Canada          Trucking
2     USA               MBA
3      UK           Nursing